; domain
(define (domain miconic)
  (:requirements :strips)
  (:types floor person)

(:predicates
  (origin ?p - person ?f - floor)
  (destin ?p - person ?f - floor)  
  (above ?f1 ?f2 - floor)
  (boarded ?p - person)
  (served ?p - person)
  (lift-at ?f - floor)
)

(:action board
  :parameters (?o1 - floor ?o2 - person)
  :precondition (and (lift-at ?o1) (origin ?o2 ?o1))
  :effect (boarded ?o2))

(:action depart
  :parameters (?o1 - floor ?o2 - person)
  :precondition (and (lift-at ?o1) (destin ?o2 ?o1)
		     (boarded ?o2))
  :effect (and (not (boarded ?o2))
	       (served ?o2)))
(:action up
  :parameters (?o1 ?o2 - floor)
  :precondition (and (lift-at ?o1) (above ?o1 ?o2))
  :effect (and (lift-at ?o2) (not (lift-at ?o1))))

(:action down
  :parameters (?o1 ?o2 - floor)
  :precondition (and (lift-at ?o1) (above ?o2 ?o1))
  :effect (and (lift-at ?o2) (not (lift-at ?o1))))
)

; problem
(define (problem mixed-f6-p3-u0-v0-g0-a0-n0-a0-b0-n0-f0-r4)
  (:domain miconic)
  (:objects p2 -  person p1 -  person p0 -  person p4 -  person p3 -  person p5 -  person f0 -  floor f1 -  floor f2 -  floor f3 -  floor f4 -  floor f5 -  floor )
  (:init (destin p2 f4) (above f0 f4) (lift-at f5) (origin p1 f2) (destin p1 f4) (origin p0 f3) (origin p2 f0) (above f1 f3) (above f3 f5) (destin p4 f5) (above f0 f1) (destin p3 f2) (above f1 f4) (origin p3 f4) (above f2 f5) (above f0 f2) (above f0 f5) (destin p0 f1) (above f2 f3) (above f0 f3) (above f1 f5) (above f1 f2) (origin p4 f2) (above f3 f4) (above f2 f4) (origin p5 f1) (above f4 f5) (destin p5 f5) )
  (:goal (and (destin p2 f4)(above f0 f4)(origin p1 f2)(destin p1 f4)(origin p0 f3)(origin p2 f0)(above f1 f3)(above f3 f5)(destin p4 f5)(above f0 f1)(destin p3 f2)(above f1 f4)(origin p3 f4)(above f2 f5)(above f0 f2)(above f0 f5)(destin p0 f1)(above f2 f3)(above f0 f3)(above f1 f5)(above f1 f2)(origin p4 f2)(above f3 f4)(above f2 f4)(origin p5 f1)(above f4 f5)(destin p5 f5)(boarded p3)(boarded p0)(lift-at f2)(not (origin p0 f0))(not (origin p0 f1))(not (origin p0 f2))(not (origin p0 f4))(not (origin p0 f5))(not (origin p1 f0))(not (origin p1 f1))(not (origin p1 f3))(not (origin p1 f4))(not (origin p1 f5))(not (origin p2 f1))(not (origin p2 f2))(not (origin p2 f3))(not (origin p2 f4))(not (origin p2 f5))(not (origin p3 f0))(not (origin p3 f1))(not (origin p3 f2))(not (origin p3 f3))(not (origin p3 f5))(not (origin p4 f0))(not (origin p4 f1))(not (origin p4 f3))(not (origin p4 f4))(not (origin p4 f5))(not (origin p5 f0))(not (origin p5 f2))(not (origin p5 f3))(not (origin p5 f4))(not (origin p5 f5))(not (destin p0 f0))(not (destin p0 f2))(not (destin p0 f3))(not (destin p0 f4))(not (destin p0 f5))(not (destin p1 f0))(not (destin p1 f1))(not (destin p1 f2))(not (destin p1 f3))(not (destin p1 f5))(not (destin p2 f0))(not (destin p2 f1))(not (destin p2 f2))(not (destin p2 f3))(not (destin p2 f5))(not (destin p3 f0))(not (destin p3 f1))(not (destin p3 f3))(not (destin p3 f4))(not (destin p3 f5))(not (destin p4 f0))(not (destin p4 f1))(not (destin p4 f2))(not (destin p4 f3))(not (destin p4 f4))(not (destin p5 f0))(not (destin p5 f1))(not (destin p5 f2))(not (destin p5 f3))(not (destin p5 f4))(not (above f0 f0))(not (above f1 f0))(not (above f1 f1))(not (above f2 f0))(not (above f2 f1))(not (above f2 f2))(not (above f3 f0))(not (above f3 f1))(not (above f3 f2))(not (above f3 f3))(not (above f4 f0))(not (above f4 f1))(not (above f4 f2))(not (above f4 f3))(not (above f4 f4))(not (above f5 f0))(not (above f5 f1))(not (above f5 f2))(not (above f5 f3))(not (above f5 f4))(not (above f5 f5))(not (boarded p1))(not (boarded p2))(not (boarded p4))(not (boarded p5))(not (served p0))(not (served p1))(not (served p2))(not (served p3))(not (served p4))(not (served p5))(not (lift-at f0))(not (lift-at f1))(not (lift-at f3))(not (lift-at f4))(not (lift-at f5)))))

; plan
1. (down f5 f4)
   deleted: (lift-at f5)
   added: (lift-at f4)
   goals met: 122 of 126
2. (board f4 p3)
   added: (boarded p3)
   goals met: 123 of 126
3. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 123 of 126
4. (board f3 p0)
   added: (boarded p0)
   goals met: 124 of 126
5. (down f3 f2)
   deleted: (lift-at f3)
   added: (lift-at f2)
   goals met: 126 of 126
